balazsgrill/modembed/res/Devices/dsPIC30/PIC24FJ128GA106.PIC
        <edc:SFRDef edc:access="nnnnnnnnnn---nnn" edc:cname="CNEN2" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000---000" edc:name="CNEN2" edc:nzwidth="0x10" edc:por="0000000000---000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CN16IE" edc:desc="" edc:mask="0x1" edc:name="CN16IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN17IE" edc:desc="" edc:mask="0x1" edc:name="CN17IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN18IE" edc:desc="" edc:mask="0x1" edc:name="CN18IE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="CN22IE" edc:desc="" edc:mask="0x1" edc:name="CN22IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN23IE" edc:desc="" edc:mask="0x1" edc:name="CN23IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN24IE" edc:desc="" edc:mask="0x1" edc:name="CN24IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN25IE" edc:desc="" edc:mask="0x1" edc:name="CN25IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN26IE" edc:desc="" edc:mask="0x1" edc:name="CN26IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN27IE" edc:desc="" edc:mask="0x1" edc:name="CN27IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN28IE" edc:desc="" edc:mask="0x1" edc:name="CN28IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN29IE" edc:desc="" edc:mask="0x1" edc:name="CN29IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN30IE" edc:desc="" edc:mask="0x1" edc:name="CN30IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN31IE" edc:desc="" edc:mask="0x1" edc:name="CN31IE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---------------n" edc:cname="CNEN3" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------0" edc:name="CNEN3" edc:nzwidth="0x10" edc:por="---------------0">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CN32IE" edc:desc="" edc:mask="0x1" edc:name="CN32IE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnn-nnnnnnnn-" edc:cname="CNEN4" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000000-00000000-" edc:name="CNEN4" edc:nzwidth="0x10" edc:por="000000-00000000-">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CN49IE" edc:desc="" edc:mask="0x1" edc:name="CN49IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN50IE" edc:desc="" edc:mask="0x1" edc:name="CN50IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN51IE" edc:desc="" edc:mask="0x1" edc:name="CN51IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN52IE" edc:desc="" edc:mask="0x1" edc:name="CN52IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN53IE" edc:desc="" edc:mask="0x1" edc:name="CN53IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN54IE" edc:desc="" edc:mask="0x1" edc:name="CN54IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN55IE" edc:desc="" edc:mask="0x1" edc:name="CN55IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN56IE" edc:desc="" edc:mask="0x1" edc:name="CN56IE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CN58IE" edc:desc="" edc:mask="0x1" edc:name="CN58IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN59IE" edc:desc="" edc:mask="0x1" edc:name="CN59IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN60IE" edc:desc="" edc:mask="0x1" edc:name="CN60IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN61IE" edc:desc="" edc:mask="0x1" edc:name="CN61IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN62IE" edc:desc="" edc:mask="0x1" edc:name="CN62IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN63IE" edc:desc="" edc:mask="0x1" edc:name="CN63IE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-------nnnnn--nn" edc:cname="CNEN5" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-------00000--00" edc:name="CNEN5" edc:nzwidth="0x10" edc:por="-------00000--00">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CN64IE" edc:desc="" edc:mask="0x1" edc:name="CN64IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN65IE" edc:desc="" edc:mask="0x1" edc:name="CN65IE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="CN68IE" edc:desc="" edc:mask="0x1" edc:name="CN68IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN69IE" edc:desc="" edc:mask="0x1" edc:name="CN69IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN70IE" edc:desc="" edc:mask="0x1" edc:name="CN70IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN71IE" edc:desc="" edc:mask="0x1" edc:name="CN71IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CN72IE" edc:desc="" edc:mask="0x1" edc:name="CN72IE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
